Revit 2024 API
ACADExportOptions.NonplotSuffix Property
 If the MarkNonplotLayers attribute is set to true, all layers with names containing this suffix will be marked as non-plot. No action will be performed if the suffix is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string NonplotSuffix { get; set; }
Visual Basic
Public Property NonplotSuffix As String
	Get
	Set
Visual C++
public:
property String^ NonplotSuffix {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace